{"weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"shape": [2, 8, 1, 8], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [8], "name": "conv2d_1/bias", "dtype": "float32"}, {"shape": [2, 4, 8, 32], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_2/bias", "dtype": "float32"}, {"shape": [2, 4, 32, 32], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_3/bias", "dtype": "float32"}, {"shape": [2, 4, 32, 32], "name": "conv2d_4/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_4/bias", "dtype": "float32"}, {"shape": [704, 2000], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [2000], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [2000, 20], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [20], "name": "dense_2/bias", "dtype": "float32"}]}], "modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"config": [{"config": {"name": "conv2d_1", "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 43, 232, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "dtype": "float32", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [2, 8], "padding": "valid", "activity_regularizer": null, "filters": 8, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "filters": 32, "data_format": "channels_last", "kernel_size": [2, 4], "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "filters": 32, "data_format": "channels_last", "kernel_size": [2, 4], "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "filters": 32, "data_format": "channels_last", "kernel_size": [2, 4], "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [1, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 2000, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 20, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential"}}}
